mh-python-el.org
#+TITLE: Python Configs for Emacs
#+AUTHOR: Mike Hostetler
#+PROPERTY:   header-args+ :comments both

#+PROPERTY:   header-args+ :mkdirp yes
#+PROPERTY:   header-args+ :tangle "~/.emacs.d/personal/mh-python.el"
#+bind: org-html-htmlize-output-type csspuA
#+OPTIONS: toc:2
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

* Prologue

A few python configs for Emacs. Most things are covered with[[file:lsp.org::*LSP%20Config][ my LSP Config]].

