public/mh-python-el.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-01-26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python Configs for Emacs</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Mike Hostetler">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="image/x-icon" href="/favicon.ico" />
<link rel="stylesheet" href="style.css" type="text/css">
</head>
<body>
<main id="content">
<header>
<h1 class="title">Python Configs for Emacs</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org48844c6">Prologue</a></li>
<li><a href="#org5178878">Blacken</a></li>
</ul>
</div>
</nav>

<section id="outline-container-org48844c6" class="outline-2">
<h2 id="org48844c6">Prologue</h2>
<div class="outline-text-2" id="text-org48844c6">
<p>
A few python configs for Emacs. Most things are covered with<a href="lsp.html#org81f2f17"> my LSP Config</a>.
</p>
</div>
</section>
