public/mh-python-el.html

<section id="outline-container-org5178878" class="outline-2">
<h2 id="org5178878">Blacken</h2>
<div class="outline-text-2" id="text-org5178878">
<p>
<a href="https://pypi.org/project/black/">Black</a> seems like a good Python formatter. Glad there is an Emacs hook!
</p>

<p>
import this from <a href="https://github.com/pythonic-emacs/blacken">https://github.com/pythonic-emacs/blacken</a>
</p>


<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">blacken.el --- Reformat python buffers using the "black" formatter</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Copyright (C) 2018-2019 Artem Malyshev</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Author: Artem Malyshev <a href="mailto:proofit404%40gmail.com">&lt;proofit404@gmail.com&gt;</a></span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Homepage: https://github.com/proofit404/blacken</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Version: 0.0.1</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Package-Requires: ((emacs "25.2"))</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is free software; you can redistribute it and/or modify</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">it under the terms of the GNU General Public License as published</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">by the Free Software Foundation; either version 3, or (at your</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">option) any later version.</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">This file is distributed in the hope that it will be useful,</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">but WITHOUT ANY WARRANTY; without even the implied warranty of</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">GNU General Public License for more details.</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">For a full copy of the GNU General Public License</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">see <a href="http://www.gnu.org/licenses/">&lt;http://www.gnu.org/licenses/&gt;</a>.</span>

<span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Blacken uses black to format a Python buffer.  It can be called</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">explicitly on a certain buffer, but more conveniently, a minor-mode</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">'blacken-mode' is provided that turns on automatically running</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">black on a buffer before saving.</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Installation:</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Add blacken.el to your load-path.</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">To automatically format all Python buffers before saving, add the</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">function blacken-mode to python-mode-hook:</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">(add-hook 'python-mode-hook 'blacken-mode)</span>
<span class="org-comment-delimiter">;;</span>
<span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:</span>

(<span class="org-keyword">require</span> '<span class="org-constant">cl-lib</span>)

(<span class="org-keyword">defgroup</span> <span class="org-type">blacken</span> nil
  <span class="org-doc">"Reformat Python code with \"black\"."</span>
  <span class="org-builtin">:group</span> 'python)

(<span class="org-keyword">defcustom</span> <span class="org-variable-name">blacken-executable</span> <span class="org-string">"black"</span>
  <span class="org-doc">"Name of the executable to run."</span>
  <span class="org-builtin">:type</span> 'string)

(<span class="org-keyword">defcustom</span> <span class="org-variable-name">blacken-line-length</span> nil
  <span class="org-doc">"Line length to enforce.</span>

<span class="org-doc">It must be an integer, nil or `</span><span class="org-doc"><span class="org-constant">fill</span></span><span class="org-doc">'.</span>
<span class="org-doc">If `</span><span class="org-doc"><span class="org-constant">fill</span></span><span class="org-doc">', the `</span><span class="org-doc"><span class="org-constant">fill-column</span></span><span class="org-doc">' variable value is used."</span>
  <span class="org-builtin">:type</span> '(choice <span class="org-builtin">:tag</span> <span class="org-string">"Line Length Limit"</span>
           (const <span class="org-builtin">:tag</span> <span class="org-string">"Use default"</span> nil)
           (const <span class="org-builtin">:tag</span> <span class="org-string">"Use fill-column"</span> fill)
           (integer <span class="org-builtin">:tag</span> <span class="org-string">"Line Length"</span>))
  <span class="org-builtin">:safe</span> 'integerp)

(<span class="org-keyword">defcustom</span> <span class="org-variable-name">blacken-allow-py36</span> nil
  <span class="org-doc">"Allow using Python 3.6-only syntax on all input files."</span>
  <span class="org-builtin">:type</span> 'boolean
  <span class="org-builtin">:safe</span> 'booleanp)

(<span class="org-keyword">defcustom</span> <span class="org-variable-name">blacken-skip-string-normalization</span> nil
  <span class="org-doc">"Don't normalize string quotes or prefixes."</span>
  <span class="org-builtin">:type</span> 'boolean
  <span class="org-builtin">:safe</span> 'booleanp)

(<span class="org-keyword">defcustom</span> <span class="org-variable-name">blacken-fast-unsafe</span> nil
  <span class="org-doc">"Skips temporary sanity checks."</span>
  <span class="org-builtin">:type</span> 'boolean
  <span class="org-builtin">:safe</span> 'booleanp)

(<span class="org-keyword">defcustom</span> <span class="org-variable-name">blacken-only-if-project-is-blackened</span> nil
  <span class="org-doc">"Only blacken if project has a pyproject.toml with a [tool.black] section."</span>
  <span class="org-builtin">:type</span> 'boolean
  <span class="org-builtin">:safe</span> 'booleanp)

(<span class="org-keyword">defun</span> <span class="org-function-name">blacken-call-bin</span> (input-buffer output-buffer error-buffer)
  <span class="org-doc">"Call process black.</span>

<span class="org-doc">Send INPUT-BUFFER content to the process stdin.  Saving the</span>
<span class="org-doc">output to OUTPUT-BUFFER.  Saving process stderr to ERROR-BUFFER.</span>
<span class="org-doc">Return black process the exit code."</span>
  (<span class="org-keyword">with-current-buffer</span> input-buffer
    (<span class="org-keyword">let</span> ((process (make-process <span class="org-builtin">:name</span> <span class="org-string">"blacken"</span>
                                 <span class="org-builtin">:command</span> `(,blacken-executable ,@(blacken-call-args))
                                 <span class="org-builtin">:buffer</span> output-buffer
                                 <span class="org-builtin">:stderr</span> error-buffer
                                 <span class="org-builtin">:noquery</span> t
                                 <span class="org-builtin">:sentinel</span> (<span class="org-keyword">lambda</span> (process event)))))
      (set-process-query-on-exit-flag (get-buffer-process error-buffer) nil)
      (set-process-sentinel (get-buffer-process error-buffer) (<span class="org-keyword">lambda</span> (process event)))
      (<span class="org-keyword">save-restriction</span>
        (widen)
        (process-send-region process (point-min) (point-max)))
      (process-send-eof process)
      (accept-process-output process nil nil t)
      (<span class="org-keyword">while</span> (process-live-p process)
        (accept-process-output process nil nil t))
      (process-exit-status process))))

(<span class="org-keyword">defun</span> <span class="org-function-name">blacken-call-args</span> ()
  <span class="org-doc">"Build black process call arguments."</span>
  (append
   (<span class="org-keyword">when</span> blacken-line-length
     (list <span class="org-string">"--line-length"</span>
           (number-to-string (<span class="org-keyword">cl-case</span> blacken-line-length
                               ('fill fill-column)
                               (t blacken-line-length)))))
   (<span class="org-keyword">when</span> blacken-allow-py36
     (list <span class="org-string">"--py36"</span>))
   (<span class="org-keyword">when</span> blacken-fast-unsafe
     (list <span class="org-string">"--fast"</span>))
   (<span class="org-keyword">when</span> blacken-skip-string-normalization
     (list <span class="org-string">"--skip-string-normalization"</span>))
   (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (buffer-file-name (current-buffer))
              (string-match <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">.pyi$"</span> (buffer-file-name (current-buffer))))
     (list <span class="org-string">"--pyi"</span>))
   '(<span class="org-string">"-"</span>)))

(<span class="org-keyword">defun</span> <span class="org-function-name">blacken-project-is-blackened</span> (<span class="org-type">&amp;optional</span> display)
  <span class="org-doc">"Whether the project has a pyproject.toml with [tool.black] in it."</span>
  (when-let ((parent (locate-dominating-file default-directory <span class="org-string">"pyproject.toml"</span>)))
    (<span class="org-keyword">with-temp-buffer</span>
      (insert-file-contents (concat parent <span class="org-string">"pyproject.toml"</span>))
      (re-search-forward <span class="org-string">"^\\[</span><span class="org-string"><span class="org-constant">tool.black\\</span></span><span class="org-string">]$"</span> nil t 1))))

<span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
(<span class="org-keyword">defun</span> <span class="org-function-name">blacken-buffer</span> (<span class="org-type">&amp;optional</span> display)
  <span class="org-doc">"Try to blacken the current buffer.</span>

<span class="org-doc">Show black output, if black exit abnormally and DISPLAY is t."</span>
  (<span class="org-keyword">interactive</span> (list t))
  (<span class="org-keyword">let*</span> ((original-buffer (current-buffer))
         (original-point (point))
         (original-window-pos (window-start))
         (tmpbuf (get-buffer-create <span class="org-string">"*blacken*"</span>))
         (errbuf (get-buffer-create <span class="org-string">"*blacken-error*"</span>)))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">This buffer can be left after previous black invocation.  It</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">can contain error message of the previous run.</span>
    (<span class="org-keyword">dolist</span> (buf (list tmpbuf errbuf))
      (<span class="org-keyword">with-current-buffer</span> buf
        (erase-buffer)))
    (<span class="org-keyword">condition-case</span> err
        (<span class="org-keyword">if</span> (not (zerop (blacken-call-bin original-buffer tmpbuf errbuf)))
            (<span class="org-warning">error</span> <span class="org-string">"Black failed, see %s buffer for details"</span> (buffer-name errbuf))
          (<span class="org-keyword">unless</span> (eq (compare-buffer-substrings tmpbuf nil nil original-buffer nil nil) 0)
            (<span class="org-keyword">with-current-buffer</span> tmpbuf
              (copy-to-buffer original-buffer (point-min) (point-max)))
            (goto-char original-point)
            (set-window-start (selected-window) original-window-pos))
          (mapc 'kill-buffer (list tmpbuf errbuf)))
      (<span class="org-warning">error</span> (message <span class="org-string">"%s"</span> (error-message-string err))
             (when display
               (pop-to-buffer errbuf))))))

<span class="org-comment-delimiter">;;;</span><span class="org-comment">###</span><span class="org-comment"><span class="org-warning">autoload</span></span>
(<span class="org-keyword">define-minor-mode</span> <span class="org-function-name">blacken-mode</span>
  <span class="org-doc">"Automatically run black before saving."</span>
  <span class="org-builtin">:lighter</span> <span class="org-string">" Black"</span>
  (<span class="org-keyword">if</span> blacken-mode
      (<span class="org-keyword">when</span> (<span class="org-keyword">or</span> (not blacken-only-if-project-is-blackened)
                (blacken-project-is-blackened))
        (add-hook 'before-save-hook 'blacken-buffer nil t))
    (remove-hook 'before-save-hook 'blacken-buffer t)))

(<span class="org-keyword">provide</span> '<span class="org-constant">blacken</span>)

<span class="org-comment-delimiter">;;; </span><span class="org-comment">blacken.el ends here</span>

</pre>
</div>

<p>
Now make sure Blacken is run with python-mode:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(add-hook 'python-mode-hook 'blacken-mode)
</pre>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<hr>
<p>
<p class="Source">Source: <a href="https://github.com/squarepegsys/literate-dotfiles/blob/master/mh-python-el.org">mh-python-el.org</a></p><p>Return to <a href="index.html">index</a>.</p>
</footer>
</body>
</html>
